# GetElementIdValue Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
ColorFillSchemeEntry..::..GetElementIdValue Method
ColorFillSchemeEntry Class See Also
---
Gets the ElementId value stored within the entry.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2022
# Syntax
C#
---
```text
public ElementId GetElementIdValue()
```

Visual Basic
---
```text
Public Function GetElementIdValue As ElementId
```

Visual C++
---
```text
public:
ElementId^ GetElementIdValue()
```

# ### Return Value
The ElementId contained in the entry.
# Remarks
This method should only be used if the StorageType property reports the type of the entry as a ElementId.
# See Also
ColorFillSchemeEntry Class
Autodesk.Revit.DB Namespace